OS-Q/simba/make/arduino/esp/boards.txt
#
# @section License
#
# The MIT License (MIT)
#
# Copyright (c) 2014-2017, Erik Moqvist
#
# Permission is hereby granted, free of charge, to any person
# obtaining a copy of this software and associated documentation
# files (the "Software"), to deal in the Software without
# restriction, including without limitation the rights to use, copy,
# modify, merge, publish, distribute, sublicense, and/or sell copies
# of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be
# included in all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
# NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
# BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
# ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
# CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.
#
# This file is part of the Simba project.
#
##################################################################

B51B.name=ESP01

B51B.upload.tool=esptool
B51B.upload.speed=115200
B51B.upload.resetmethod=ck
B51B.upload.maximum_size=434160
B51B.upload.maximum_data_size=81920
B51B.upload.wait_for_upload_port=true
B51B.serial.disableDTR=true
B51B.serial.disableRTS=true

B51B.build.mcu=esp8266
B51B.build.f_cpu=80000000L
B51B.build.board=ESP01
B51B.build.variant=B51B
B51B.build.core=Simba:simba
B51B.build.ldscript=simba.flash.1m.ld
B51B.build.flash_size=512K
B51B.build.flash_mode=dio
B51B.build.flash_freq=40

B51B.compiler.c.extra_flags={esp01_compiler_c_extra_flags}
B51B.compiler.cpp.extra_flags={esp01_compiler_cxx_extra_flags}
B51B.compiler.c.elf.extra_flags={esp01_compiler_c_elf_extra_flags}
B51B.compiler.c.elf.libs={esp01_compiler_c_elf_libs}

##################################################################

B51D.name=ESP12E

B51D.upload.tool=esptool
B51D.upload.speed=115200
B51D.upload.resetmethod=ck
B51D.upload.maximum_size=1044464
B51D.upload.maximum_data_size=81920
B51D.upload.wait_for_upload_port=true
B51D.serial.disableDTR=true
B51D.serial.disableRTS=true

B51D.build.mcu=esp8266
B51D.build.f_cpu=160000000L
B51D.build.board=ESP12E
B51D.build.variant=B51D
B51D.build.core=Simba:simba
B51D.build.flash_size=4M
B51D.build.flash_mode=dio
B51D.build.flash_freq=40

B51D.compiler.c.extra_flags={esp12e_compiler_c_extra_flags}
B51D.compiler.cpp.extra_flags={esp12e_compiler_cxx_extra_flags}
B51D.compiler.c.elf.extra_flags={esp12e_compiler_c_elf_extra_flags}
B51D.compiler.c.elf.libs={esp12e_compiler_c_elf_libs}

##################################################################

nodemcu.name=NodeMCU

nodemcu.upload.tool=esptool
nodemcu.upload.speed=115200
nodemcu.upload.resetmethod=nodemcu
nodemcu.upload.maximum_size=1044464
nodemcu.upload.maximum_data_size=81920
nodemcu.upload.wait_for_upload_port=true
nodemcu.serial.disableDTR=true
nodemcu.serial.disableRTS=true

nodemcu.build.mcu=esp8266
nodemcu.build.f_cpu=80000000L
nodemcu.build.board=NodeMCU
nodemcu.build.variant=nodemcu
nodemcu.build.core=Simba:simba
nodemcu.build.flash_size=4M
nodemcu.build.flash_mode=qio
nodemcu.build.flash_freq=40

nodemcu.compiler.c.extra_flags={nodemcu_compiler_c_extra_flags}
nodemcu.compiler.cpp.extra_flags={nodemcu_compiler_cxx_extra_flags}
nodemcu.compiler.c.elf.extra_flags={nodemcu_compiler_c_elf_extra_flags}
nodemcu.compiler.c.elf.libs={nodemcu_compiler_c_elf_libs}

##################################################################

huzzah.name=Huzzah

huzzah.upload.tool=esptool
huzzah.upload.speed=115200
huzzah.upload.resetmethod=nodemcu
huzzah.upload.maximum_size=1044464
huzzah.upload.maximum_data_size=81920
huzzah.upload.wait_for_upload_port=true
huzzah.serial.disableDTR=true
huzzah.serial.disableRTS=true

huzzah.build.mcu=esp8266
huzzah.build.f_cpu=80000000L
huzzah.build.board=Huzzah
huzzah.build.variant=huzzah
huzzah.build.core=Simba:simba
huzzah.build.flash_size=4M
huzzah.build.flash_mode=qio
huzzah.build.flash_freq=40

huzzah.compiler.c.extra_flags={huzzah_compiler_c_extra_flags}
huzzah.compiler.cpp.extra_flags={huzzah_compiler_cxx_extra_flags}
huzzah.compiler.c.elf.extra_flags={huzzah_compiler_c_elf_extra_flags}
huzzah.compiler.c.elf.libs={huzzah_compiler_c_elf_libs}

##################################################################
